[
  {
    "id": "bukhari",
    "name": "صحيح البخاري",
    "englishName": "Sahih al-Bukhari",
    "numberOfHadiths": 7563,
    "hadiths": [
      {
        "id": 1,
        "text": "عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: «إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه»",
        "grade": "صحيح",
        "book": "بدء الوحي",
        "chapter": "كيف كان بدء الوحي إلى رسول الله صلى الله عليه وسلم",
        "narrator": "عمر بن الخطاب"
      },
      {
        "id": 2,
        "text": "عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: «من أحدث في أمرنا هذا ما ليس منه فهو رد»",
        "grade": "صحيح",
        "book": "الصلح",
        "chapter": "إذا اصطلحوا على صلح جور فالصلح مردود",
        "narrator": "عائشة رضي الله عنها"
      },
      {
        "id": 3,
        "text": "عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: «بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، والحج، وصوم رمضان»",
        "grade": "صحيح",
        "book": "الإيمان",
        "chapter": "قول النبي صلى الله عليه وسلم: «بني الإسلام على خمس»",
        "narrator": "عبد الله بن عمر"
      }
    ]
  },
  {
    "id": "muslim",
    "name": "صحيح مسلم",
    "englishName": "Sahih Muslim",
    "numberOfHadiths": 5362,
    "hadiths": [
      {
        "id": 1,
        "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير. احرص على ما ينفعك، واستعن بالله ولا تعجز»",
        "grade": "صحيح",
        "book": "القدر",
        "chapter": "في الأمر بالقوة وترك العجز والاستعانة بالله",
        "narrator": "أبو هريرة"
      },
      {
        "id": 2,
        "text": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «كل عمل ابن آدم له إلا الصوم فإنه لي وأنا أجزي به»",
        "grade": "صحيح",
        "book": "الصيام",
        "chapter": "فضل الصوم",
        "narrator": "أبو هريرة"
      }
    ]
  },
  {
    "id": "tirmidhi",
    "name": "سنن الترمذي",
    "englishName": "Jami` at-Tirmidhi",
    "numberOfHadiths": 3956,
    "hadiths": [
      {
        "id": 1,
        "text": "عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: «اغتنم خمساً قبل خمس: شبابك قبل هرمك، وصحتك قبل سقمك، وغناك قبل فقرك، وفراغك قبل شغلك، وحياتك قبل موتك»",
        "grade": "حسن",
        "book": "الزهد",
        "chapter": "ما جاء في المبادرة بالعمل",
        "narrator": "ابن عباس"
      }
    ]
  }
]